app/controllers/scientist_experiments_controller.rb

SELECT "experiments".* FROM "experiments" WHERE "experiments"."id" = $1 LIMIT $2  [["id", 76], ["LIMIT", 1]]
SELECT "scientist_experiments".* FROM "scientist_experiments" WHERE "scientist_experiments"."id" = $1 LIMIT $2  [["id", 76], ["LIMIT", 1]]
DELETE FROM "scientist_experiments" WHERE "scientist_experiments"."id" = $1  [["id", 109]]
---
  def destroy
    se = ScientistExperiment.find(params[:id])
    scientist = se.scientist
    se.destroy