app/views/scientists/show.html.erb

SELECT "scientist_experiments".* FROM "scientist_experiments" WHERE "scientist_experiments"."scientist_id" = $1  [["scientist_id", 46]]
---
<div id="experiments">
  <% @scientist.scientist_experiments.each do |se| %>